# Homebrew packages and casks for setting up a new machine

brew "age"
brew "git"
brew "chezmoi"
brew "eza"
brew "batt"
brew "bat"
brew "backlog-md"
brew "fzf"
brew "micro"
brew "powerlevel10k"
brew "speedtest-cli"
brew "tmux"
brew "zns"
brew "zoxide"
brew "llama.cpp"

# Casks for GUI applications
cask "1password"
cask "1password-cli"
cask "kiro"
cask "visual-studio-code"
cask "iterm2"
cask "protonvpn"
cask "font-fira-mono-nerd-font"
cask "textmate"
cask "royal-tsx"
cask "setapp"
